# Ultralytics YOLOv5 🚀, AGPL-3.0 license

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]],  # Example backbone conv layers
    [-1, 1, Conv, [256, 3, 2]],
    [-1, 3, C3, [256]],
    [-1, 1, Conv, [256, 3, 2]],  # Example P3/8
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]],  # Example P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]],  # Example P5/32
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]],     # Example SPPF
  ]

head: [
    # x1 and x2 processing and concatenation
    [-1, 1, Conv, [256, 1, 1]],  # x1 Conv: 256 channels
    [-1, 1, Conv, [192, 1, 1]],  # x2 Conv: 192 channels
    
    # Concatenate
    [[-1, 6], 1, Concat, [1]],   # Concatenate x1 and x2 -> 448 channels
    
    # Post-concat Conv to match the next layer's requirements
    [-1, 1, Conv, [512, 1, 1]],  # Adjust to 512 channels
    
    # Continue with upsampling or other operations
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 4], 1, Concat, [1]],   # Further concatenation
    [-1, 3, C3, [256, 128, 1, False]],  # Processing continues
]


